{"class_name": "Sequential", "optimizer": {"epsilon": 1e-08, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "name": "Adam", "beta_2": 0.9990000128746033}, "loss": "categorical_crossentropy", "sample_weight_mode": null, "config": [{"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 1500, "init": "glorot_uniform", "input_dtype": "float32", "activation": "linear", "bias": true, "b_regularizer": null, "trainable": true, "input_dim": 4, "activity_regularizer": null, "batch_input_shape": [null, 4], "W_constraint": null, "b_constraint": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 1500, "init": "glorot_uniform", "activation": "linear", "bias": true, "b_regularizer": null, "trainable": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 1500, "init": "glorot_uniform", "activation": "linear", "bias": true, "b_regularizer": null, "trainable": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_3"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "output_dim": 9, "init": "glorot_uniform", "activation": "linear", "bias": true, "b_regularizer": null, "trainable": true, "input_dim": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "dense_4"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_4"}}], "keras_version": "1.0.3"}