{"sample_weight_mode": null, "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"activation": "linear", "input_dim": 4, "input_dtype": "float32", "W_regularizer": null, "activity_regularizer": null, "output_dim": 1500, "trainable": true, "name": "dense_1", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "batch_input_shape": [null, 4], "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "linear", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1500, "trainable": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"name": "dense_3", "activation": "linear", "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 9, "trainable": true, "b_constraint": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "bias": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_3"}}], "loss": "categorical_crossentropy", "optimizer": {"epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam", "beta_1": 0.8999999761581421}, "keras_version": "1.0.3"}