{"config": [{"class_name": "Dense", "config": {"activation": "linear", "input_dtype": "float32", "output_dim": 1000, "batch_input_shape": [null, 4], "b_regularizer": null, "input_dim": 4, "b_constraint": null, "trainable": true, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_4", "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_4"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "output_dim": 1000, "name": "dense_5", "b_regularizer": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_5"}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "output_dim": 9, "name": "dense_6", "b_regularizer": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_6"}}], "sample_weight_mode": null, "loss": "categorical_crossentropy", "class_name": "Sequential", "optimizer": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-08, "name": "Adam", "lr": 0.0010000000474974513}, "keras_version": "1.0.3"}